{
  "title": "Back Pain",
  "description": "Back pain is discomfort or pain that can occur anywhere in the spine (neck to lower back). It can be mild or severe, and may affect your ability to move, stand, or sit comfortably.",
  "sections": [
    {
      "heading": "Common Symptoms",
      "content": "Pain in the lower back, middle back, or upper back\n\nStiffness in the back, difficulty bending or straightening up\n\nMuscle spasms (sharp, tight pains in muscles)\n\nRadiating pain to the legs (sciatica) or arms\n\nNumbness or tingling in the back, legs, or arms\n\nPain when standing, sitting, or lying down for long periods\n\nPain that worsens with activity or movement"
    },
    {
      "heading": "Common Causes",
      "content": "**1) Muscle or Ligament Strain:**\n\nOveruse or heavy lifting\n\nPoor posture while sitting or standing\n\nSudden twisting or bending movements\n\n\n**2) Injury or Trauma:**\n\nSprains or strains from falls or accidents\n\nFractures in the spine due to injury\n\n\n**3) Degenerative Conditions:**\n\nOsteoarthritis: Wear and tear on spinal joints\n\nHerniated disc: Disc between vertebrae slips out of place\n\nSpinal stenosis: Narrowing of the spine, putting pressure on nerves\n\n\n**4) Lifestyle Factors:**\n\nPoor posture or sitting for long periods\n\nObesity or lack of exercise\n\nStress or tension leading to muscle tightness\n\n\n**5) Medical Conditions:**\n\nSciatica: Pain running down the leg from the lower back\n\nScoliosis: Curvature of the spine\n\nKidney problems (sometimes cause referred pain in the back)"
    },
    {
      "heading": "Precautions & Home Care",
      "content": "Rest: Take breaks, especially if you’re lifting or sitting for long periods.\n\nCold/Hot Compress: Apply a cold pack to reduce inflammation, or a warm pack to relax muscles.\n\nPain relievers: Use ibuprofen or paracetamol for pain relief (follow dosage instructions).\n\nStretching: Gentle stretches to relieve muscle tightness, but avoid overdoing it.\n\nGood posture: Avoid slouching; use a supportive chair and lift objects properly.\n\nStay active: Regular light exercise (eg, walking, swimming) can strengthen back muscles.\n\nUse ergonomic furniture: Ensure your workspace is set up to support your back."
    },
    {
      "heading": "When to See a Doctor",
      "content": "Back pain lasts more than 1–2 weeks without improvement.\n\nSevere pain that prevents you from moving, standing, or sitting.\n\nPain radiating to legs or arms, especially with numbness or tingling.\n\nPain after a fall or injury, especially if you suspect a fracture.\n\nWeakness in the legs or loss of control of bladder or bowel function (could be a sign of a serious condition like cauda equina syndrome).\n\nPain accompanied by fever or unexplained weight loss (could indicate an infection or other serious issue)."
    },
    {
      "heading": "Emergency Signs – Go to the ER If:",
      "content": "Severe, sudden back pain after an injury or accident.\n\nNumbness or tingling in the legs or around the groin area.\n\nLoss of control over bladder or bowels (incontinence).\n\nPain with fever, chills, or unexplained weight loss (could be signs of an infection or cancer).\n\nPain that doesn’t improve with rest or over-the-counter medications."
    },
    {
      "heading": "Treatment from a Doctor",
      "content": "Physical therapy: To strengthen muscles and improve posture\n\nPrescription medications: Stronger pain relievers, muscle relaxants, or anti-inflammatory drugs\n\nInjections: Corticosteroid injections to reduce inflammation\n\nX-rays or MRI to diagnose the cause of pain (e.g., herniated disc, arthritis)\n\nSurgery in severe cases (e.g., for herniated discs or spinal stenosis)"
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t stay in bed for long periods—too much rest can make the pain worse.\n\nDon’t lift heavy objects or do strenuous activities that may strain the back.\n\nDon’t ignore severe pain that radiates to the legs or causes numbness.\n\nDon’t try to diagnose or treat yourself if the pain is severe or long-lasting—seek medical advice."
    }
  ]
}
