{
  "title": "Child birth",
  "description": "Child birth is the process through which a baby is born from the mother's womb. It usually happens around 37 to 42 weeks of pregnancy. It can be natural, assisted, or through cesarean section (C-section).",
  "sections": [
    {
      "heading": "3 Main Stages of Child birth",
      "content": "1) Labor: This is when the body starts preparing to deliver the baby. Signs of labor include regular contractions (tightening of the belly), water breaking (fluid leaks from the vagina), back pain and pelvic pressure, and bloody show (mucus with blood).\n\n2) Delivery (Pushing Stage): When the cervix is fully open (10 cm), the mother starts pushing. The baby moves down the birth canal. Baby’s head appears (called \"crowning\") and then the body follows.\n\n3) Delivery of the Placenta: After the baby is born, the placenta (afterbirth) comes out. This usually takes 5–30 minutes after the baby is delivered."
    },
    {
      "heading": "Ways a Baby Can Be Delivered",
      "content": " Vaginal Delivery (Natural Birth): Most common method. Can be with or without pain relief. Faster recovery time.\n\n Assisted Delivery: Tools like forceps or vacuum may be used if baby needs help coming out.\n\n Cesarean Section (C-section): Surgical procedure. Done if normal delivery is unsafe (e.g., baby in wrong position, health emergency)."
    },
    {
      "heading": "Pain Relief Options",
      "content": "Breathing and relaxation techniques. Epidural (injection in the back to numb the lower body). Gas and air (inhaled to reduce pain). Pain-relief injections (like pethidine). Warm water baths or massages."
    },
    {
      "heading": "Emergency Situations During Childb irth",
      "content": "Seek medical help if: heavy bleeding, baby’s movement suddenly stops, severe headache or vision problems, high blood pressure (possible preeclampsia), labor doesn’t progress, baby in distress (eg, abnormal heart rate)."
    },
    {
      "heading": "Recovery After Child birth",
      "content": "Bleeding (called lochia) for a few weeks is normal. May feel sore, tired, and emotional. Body takes time to return to normal. Breastfeeding can start right after birth. Doctors check both mother and baby for any complications."
    },
    {
      "heading": "Tips for a Safe Child birth",
      "content": "Regular prenatal check-ups. Eat healthy, stay active, and avoid harmful substances. Learn birth positions and breathing techniques. Prepare a hospital bag in advance. Know the route to the hospital. Have a birth plan, but be flexible if things change. Take help from a support person, like partner or doula."
    },
    {
      "heading": "Signs to Go to the Hospital",
      "content": "Strong, regular contractions (every 5 minutes for at least 1 hour). Water breaks. Heavy bleeding. Severe pain. No baby movement. If due date passes 41 weeks."
    }
  ]
}
