{
  "title": "Sudden Dizziness When Standing Up",
  "description": "Sudden dizziness when standing up is often a brief feeling of light-headedness, spinning, or unsteadiness that happens as you rise from sitting or lying down. It usually lasts a few seconds to a minute.",
  "sections": [
    {
      "heading": "Common Causes",
      "content": "Orthostatic Hypotension: A sudden drop in blood pressure when standing up. Common in dehydration, prolonged sitting, or certain medications.\n\nDehydration: Not drinking enough water can reduce blood volume, causing dizziness.\n\nAnemia: Low red blood cell count means less oxygen to the brain.\n\nLow blood sugar: Especially if you haven’t eaten for a while or have diabetes.\n\nInner ear problems (like vertigo): Affects balance and may cause spinning or swaying sensations.\n\nMedication side effects: Some drugs for blood pressure, depression, or anxiety can cause dizziness.\n\nHeart problems: Irregular heartbeat or poor circulation can trigger dizzy spells.\n\nFatigue or lack of sleep: Can reduce alertness and blood pressure."
    },
    {
      "heading": "Symptoms to Watch For",
      "content": "Light-headedness or “head rush”\n\nFeeling faint or off balance\n\nBlurry vision\n\nNausea\n\nWeakness or shakiness\n\nTinnitus (ringing in ears)\n\nShortness of breath or chest discomfort (if heart-related)"
    },
    {
      "heading": "What to Do Immediately",
      "content": "Sit or lie down right away to avoid falling.\n\nTake deep breaths slowly.\n\nRaise your legs if lying down — it helps blood flow back to the brain.\n\nDrink water if you haven’t had fluids in a while."
    },
    {
      "heading": "When to See a Doctor or Go to the ER",
      "content": "Dizziness happens frequently or severely\n\nYou faint or lose consciousness\n\nIt’s accompanied by chest pain, palpitations, or shortness of breath\n\nYou feel confused or weak on one side of the body\n\nYou have vision or speech problems\n\nYou’re on blood pressure medication and the symptoms are new or worsening"
    },
    {
      "heading": "Home Care and Lifestyle Tips",
      "content": "Get up slowly from bed or chair — pause between sitting and standing.\n\nDrink plenty of fluids — especially in hot weather or after exercise.\n\nEat regular meals — avoid skipping meals to prevent low blood sugar.\n\nWear compression socks (if advised) to improve blood circulation.\n\nAvoid alcohol — it can lower blood pressure.\n\nMonitor medications — talk to your doctor if you suspect a side effect."
    },
    {
      "heading": "Emergency Medicines (only if prescribed)",
      "content": "Fludrocortisone – Raises blood pressure in cases of orthostatic hypotension.\n\nMidodrine – Used for chronic low blood pressure.\n\nMeclizine – For dizziness caused by inner ear issues.\n\nGlucose tablets or snacks – If low blood sugar is the cause."
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t stand up too fast.\n\nDon’t ignore frequent episodes — it could be a sign of something serious.\n\nDon’t skip meals or stay dehydrated.\n\nDon’t drive or operate machines during an episode."
    }
  ]
}
