{
  "title": "Drug Overdose",
  "description": "This guide helps identify signs of a drug overdose, how to respond, and how to prevent it. Recognizing symptoms early and acting fast can save lives.",
  "sections": [
    {
      "heading": "Look for These Signs",
      "content": "1) Very Sleepy or Hard to Wake Up\nThe person may not respond or seem confused.\n\n2) Slow or No Breathing\nBreathing may stop, be very slow, or sound strange (gasping).\n\n3) Cold, Pale, or Blue Skin\nLips or fingers may turn blue or gray.\nSkin may feel cold or look pale.\n\n4) Vomiting\nThe person may throw up, even while unconscious.\n\n5) Small or Big Pupils\nPupils (black part of eyes) may look very tiny or large.\n\n6) Seizures or Shaking\nThe body may jerk or shake uncontrollably.\n\n7) Chest Pain or Fast Heartbeat\nThe person may clutch their chest or have trouble breathing.\n\n8) Unusual Behavior\nActing very confused, scared, angry, or paranoid."
    },
    {
      "heading": "What to Do",
      "content": "Call 112 (or your local emergency number) right away.\n\nDon’t leave the person alone.\n\nTry to keep them awake and on their side (not on their back).\n\nGive basic first aid if trained (like CPR if they stop breathing)."
    },
    {
      "heading": "Important Tip",
      "content": "Even if the person wakes up and feels okay, they still need medical help."
    },
    {
      "heading": "Drug Overdose Precautions – Simple & Clear",
      "content": "1) Never take more than prescribed\nFollow your doctor’s instructions exactly. Do not increase your dose without consulting a healthcare professional.\n\n2) Do not mix drugs\nAvoid mixing medications, especially:\n- Painkillers (like opioids) with alcohol or sedatives\n- Prescription drugs with recreational drugs\n- Different central nervous system depressants (like sleeping pills and anxiety meds)\n\n3) Read labels carefully\nAlways check labels for:\n- Dosage\n- Warnings\n- Drug interactions\n\n4) Talk to your doctor/pharmacist\nAsk if any new medicine may interact with current meds. Let them know about all medications you’re taking, including over-the-counter or herbal supplements.\n\n5) Use reminders for dosage\nUse a pill box, mobile app, or alarm to take medicine on time and prevent double doses.\n\n6) Avoid using others’ medications\nNever take medicines prescribed for someone else. It could be the wrong drug or dose for you.\n\n7) Store medicines safely\nKeep medications in their original containers. Store them out of children’s reach. Avoid heat or humidity which can change how some drugs work.\n\n8) Avoid alcohol and drugs when on medication\nAlcohol and recreational drugs can increase overdose risk when mixed with prescription meds.\n\n9) Watch for warning signs\nFeeling drowsy, confused, or overly sleepy after a dose can be a sign of overdose. Contact a doctor right away.\n\n10) Educate your family/friends\nMake sure loved ones know:\n- What medicines you take\n- Basic first aid for overdose\n- How to call for emergency help"
    },
    {
      "heading": "Emergency Tips for Suspected Overdose",
      "content": "Call emergency services immediately (India: 112)\n\nDo not wait for symptoms to worsen.\n\nTry to identify the drug taken (save the container if possible).\n\nDo not induce vomiting unless told by a medical professional.\n\nKeep the person awake and breathing, if possible.\n\nIf unconscious and not breathing, start CPR and wait for help."
    }
  ]
}
