{
  "title": "Nausea",
  "description": "Nausea is the sensation of feeling like you are going to vomit, even if you don't actually throw up. It’s an uncomfortable feeling in the stomach that can happen with or without vomiting.",
  "sections": [
    {
      "heading": "Common Symptoms",
      "content": "Feeling of queasiness or discomfort in the stomach.\n\nIncreased salivation or a sensation of “sourness” in the mouth.\n\nSweating, dizziness, or feeling lightheaded.\n\nLoss of appetite or the urge to avoid food.\n\nGurgling or bloating in the stomach.\n\nVomiting, sometimes accompanying nausea."
    },
    {
      "heading": "Common Causes",
      "content": "**1) Digestive Issues:**\nFood poisoning: Ingesting contaminated food or water can lead to nausea and vomiting.\n\nIndigestion: Eating too much or too quickly can cause nausea.\n\nGastritis: Inflammation of the stomach lining can lead to nausea.\n\nAcid reflux or heartburn: Stomach acid rising into the esophagus can cause nausea.\n\nConstipation: Severe constipation may make you feel nauseous.\n\n\n**2) Illnesses and Infections:**\nStomach flu (Gastroenteritis): An infection in the stomach or intestines that causes nausea, vomiting, and diarrhea.\n\nMigraine: Nausea often accompanies migraine headaches.\n\nMotion sickness: Caused by traveling in a car, boat, or airplane, leading to nausea.\n\nInfections: Various infections, such as the flu or COVID-19, can cause nausea.\n\n\n**3) Medical Conditions:**\nPregnancy: Nausea during pregnancy, especially in the early stages (morning sickness).\n\nMedications: Some medications, such as chemotherapy drugs or antibiotics, can cause nausea as a side effect.\n\nLiver disease or kidney failure: Issues with these organs can cause nausea.\n\nBrain-related conditions: Migraines, concussion, or brain tumor can trigger nausea.\n\n\n**4) Lifestyle Factors:**\nStress or anxiety: Emotional stress or panic can lead to nausea.\n\nDehydration: Lack of sufficient fluids in the body can cause nausea.\n\nExcessive alcohol or smoking: Both can irritate the stomach and lead to nausea."
    },
    {
      "heading": "Precautions & Home Care",
      "content": "Stay hydrated: Sip small amounts of water, ginger tea, or electrolyte drinks to avoid dehydration.\n\nEat light meals: If you’re feeling nauseous, avoid greasy, spicy, or heavy foods. Try crackers, rice, or bland foods.\n\nAvoid strong smells: Scents from perfumes, food, or smoke can trigger nausea.\n\nRest: Lie down in a comfortable position, but avoid lying flat. A half-sitting position may help.\n\nGinger or peppermint: These are natural remedies that can help soothe nausea. Try ginger tea, ginger ale, or peppermint tea.\n\nAvoid triggers: If you know what’s causing the nausea (like motion or stress), try to avoid those triggers.\n\nSmall, frequent meals: Instead of large meals, try eating smaller, more frequent meals to prevent nausea."
    },
    {
      "heading": "When to See a Doctor",
      "content": "Persistent nausea that doesn’t improve after a few hours or days.\n\nNausea with severe pain: This could be related to appendicitis, gallstones, or other serious conditions.\n\nNausea with vomiting that lasts for more than 24 hours.\n\nNausea after head injury: If nausea follows a blow to the head, it could be a sign of a concussion or other brain injury.\n\nBlood in vomit or black, tarry stool: These could be signs of bleeding in the digestive tract.\n\nSevere dehydration: Signs include dry mouth, dizziness, and little to no urine output.\n\nFever along with nausea or vomiting, especially if the fever is high."
    },
    {
      "heading": "Emergency Signs – Go to the ER If:",
      "content": "Severe abdominal pain with nausea, which could indicate a serious condition like appendicitis or pancreatitis.\n\nNausea with chest pain or difficulty breathing—could be signs of a heart attack.\n\nSudden, severe headache with nausea, which could indicate a brain issue like a stroke or migraine.\n\nBlood in vomit or vomiting continuously for more than 24 hours.\n\nSevere dehydration that does not improve with drinking fluids (could be dangerous if left untreated)."
    },
    {
      "heading": "Treatment from a Doctor",
      "content": "Anti-nausea medications: Drugs like ondansetron or meclizine may be prescribed to stop nausea and vomiting.\n\nIV fluids: If dehydration is severe, your doctor may give fluids through an IV.\n\nTreatment for the underlying cause: If nausea is caused by an infection, medical condition, or medication, the doctor will address the root cause.\n\nAntacids: If acid reflux is causing nausea, your doctor may prescribe medications to neutralize stomach acid.\n\nPsychological treatment: If stress or anxiety is causing nausea, relaxation techniques, counseling, or medications may help."
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t eat heavy or spicy foods when you’re feeling nauseous—this can worsen your symptoms.\n\nAvoid lying flat if you feel nauseous—lying down can make nausea worse. Try sitting upright.\n\nDon’t ignore prolonged symptoms—if nausea lasts for an extended period or is associated with severe pain, you should seek medical attention."
    }
  ]
}
