{
  "title": "Nosebleed",
  "description": "A nosebleed occurs when blood vessels inside the nose break, causing blood to flow out. It can be triggered by factors such as dry air, allergies, injury, or irritation.",
  "sections": [
    {
      "heading": "Symptoms of a Nosebleed",
      "content": "Blood flowing from one or both nostrils, which may be bright red or darker depending on the source. There may be a feeling of fullness or pressure in the nose and dryness or irritation before bleeding starts."
    },
    {
      "heading": "Steps for Basic Nosebleed Care",
      "content": "1) Stay calm to avoid raising blood pressure.\n2) Sit up straight and lean forward slightly to prevent blood from flowing down the throat. Do NOT lie down.\n3) Pinch your nostrils together using your thumb and index finger, breathe through your mouth, and maintain pressure for 5–10 minutes without peeking.\n4) Apply a cold compress to the back of the neck or bridge of the nose to constrict blood vessels.\n5) After bleeding stops, avoid blowing your nose, keep it moist with saline spray or petroleum jelly, and avoid picking or scratching inside the nostrils."
    },
    {
      "heading": "Precautions to Prevent Nosebleeds",
      "content": "Use a humidifier in dry environments to maintain moisture.\nAvoid picking or forceful blowing of the nose.\nUse saline sprays to keep nasal passages moist.\nWear protective gear during activities that risk nose injury.\nManage allergies with appropriate medications to reduce nasal irritation."
    },
    {
      "heading": "When to Seek Emergency Care",
      "content": "If bleeding lasts more than 20 minutes despite care.\nIf bleeding follows a head injury.\nIf the person has trouble breathing or swallowing blood.\nIf frequent nosebleeds occur or blood clotting disorders are present.\nIf bleeding happens after taking blood thinners like aspirin or warfarin."
    },
    {
      "heading": "Emergency Medicine for Nosebleeds",
      "content": "Cauterization may be performed by a doctor to seal bleeding vessels.\nNasal packing with gauze or sponges might be needed for severe bleeding.\nTopical vasoconstrictors may be applied to narrow blood vessels and stop bleeding."
    },
    {
      "heading": "What Not to Do",
      "content": "Do NOT tilt your head back as it can cause blood to flow into the throat, risking choking.\nDo NOT insert tissues or cotton into the nose.\nDo NOT lie down, which may increase nasal blood pressure."
    }
  ]
}
