{
  "title": "Painful Urination",
  "description": "Painful urination is a burning, stinging, or discomfort feeling while passing urine. It can happen to anyone and often signals an infection or irritation in the urinary tract.",
  "sections": [
    {
      "heading": "Common Symptoms",
      "content": "Burning or stinging feeling during or after peeing. Frequent urge to urinate, even if little comes out. Lower abdominal or pelvic pain. Cloudy or foul-smelling urine. Blood in urine (pink, red, or brown color). Discomfort in lower back or side (if kidneys are involved). Fever or chills (if infection has spread)."
    },
    {
      "heading": "Possible Causes",
      "content": "Urinary Tract Infection (UTI) – most common cause, especially in women. Sexually Transmitted Infections (STIs) – such as chlamydia or gonorrhea. Kidney Stones – sharp pain, may also see blood in urine. Bladder infection (Cystitis). Prostatitis – inflammation of the prostate (in men). Irritation from products – like soaps, bubble baths, or scented wipes. Tight clothing or poor hygiene. Vaginal infection or yeast infection – in women."
    },
    {
      "heading": "Precautions and Prevention",
      "content": "Hygiene: Wipe front to back (especially for women). Wash genitals daily with mild soap. Avoid scented soaps, sprays, or powders. Hydration: Drink plenty of water daily to flush out bacteria. Urination habits: Do not hold urine for long periods. Urinate after sex to reduce UTI risk. Safe sex: Use protection (condoms). Get regular STI screenings. Clothing: Wear loose, breathable underwear (preferably cotton). Avoid tight jeans or damp clothes for long periods."
    },
    {
      "heading": "Home Care Tips",
      "content": "Drink extra water to help flush out bacteria. Avoid caffeine and spicy foods as they may irritate the bladder. Use a heating pad on lower belly for comfort. Over-the-counter pain relief (like paracetamol or ibuprofen) can help ease discomfort."
    },
    {
      "heading": "When to See a Doctor or Visit the ER",
      "content": "Go to the doctor or ER if you have pain with fever, chills, or back pain (possible kidney infection). Blood in urine. Nausea or vomiting. Pain getting worse or not improving in 1–2 days. Discharge from the penis or vagina. Pain during sex. You’re pregnant and have symptoms."
    },
    {
      "heading": "Possible Emergency Medications (prescribed by doctor)",
      "content": "Antibiotics for UTI, bladder, or kidney infections. Antifungals if caused by a yeast infection. Antivirals in case of viral STIs. Urinary pain relievers (eg, phenazopyridine) for short-term relief. Important: Never take antibiotics without a prescription."
    },
    {
      "heading": "What NOT to Do",
      "content": "Do not self-medicate with antibiotics. Do not ignore symptoms, especially if worsening. Don’t delay urination – go when you feel the urge. Avoid irritants like scented pads, douches, or harsh soaps."
    }
  ]
}
