{
  "title": "Pain When Coughing",
  "description": "Pain when coughing means you feel discomfort or pain in your chest, side, ribs, back, or throat every time you cough. It can be mild or sharp, depending on the cause.",
  "sections": [
    {
      "heading": "Possible Causes",
      "content": "Common cold or flu – Sore throat, muscle strain, or inflamed airways.\n\nChest infection (bronchitis or pneumonia) – Deep chest pain, often with mucus or fever.\n\nMuscle strain – Coughing a lot can strain chest or rib muscles.\n\nRib injury or fracture – A cracked or bruised rib can hurt when you cough or breathe.\n\nPleurisy – Inflammation of the lung lining causing sharp chest pain.\n\nAcid reflux (GERD) – Stomach acid can irritate the throat and chest.\n\nAsthma – Tightness in chest, wheezing, and cough.\n\nLung problems – Like a collapsed lung or a blood clot (rare, but serious).\n\nCOVID-19 – Can cause cough with chest pain and breathing difficulty."
    },
    {
      "heading": "Symptoms to Watch For",
      "content": "Sharp or stabbing pain when coughing\n\nPain that spreads to shoulder or back\n\nShortness of breath\n\nFever or chills\n\nYellow or bloody mucus\n\nChest tightness\n\nFatigue or weakness\n\nWheezing"
    },
    {
      "heading": "When to Go to the Doctor or ER",
      "content": "Chest pain is sudden or severe\n\nTrouble breathing or speaking\n\nHigh fever (above 101°F or 38.3°C)\n\nCoughing up blood\n\nFast heartbeat or dizziness\n\nChest pain after injury (possible rib fracture)\n\nIf pain lasts more than a few days"
    },
    {
      "heading": "Home Care and First Aid",
      "content": "Rest your body and avoid overexerting your lungs.\n\nDrink warm fluids to soothe your throat and loosen mucus.\n\nUse a humidifier to moisten the air and reduce coughing.\n\nWarm compress on your chest or back for muscle pain.\n\nCough medicine (if needed): Use over-the-counter remedies like cough suppressants or lozenges.\n\nPain relievers: Take paracetamol or ibuprofen for pain and inflammation (ask a doctor if unsure)."
    },
    {
      "heading": "Precautions",
      "content": "Avoid smoking or secondhand smoke.\n\nDon’t lie flat while coughing — use pillows to keep your upper body raised.\n\nAvoid spicy and acidic foods if you have acid reflux.\n\nAvoid cold air — wear a scarf or mask in cold weather.\n\nDon’t ignore persistent or worsening symptoms."
    },
    {
      "heading": "Emergency Medicines (only under doctor advice)",
      "content": "Antibiotics: If there’s a bacterial infection (not for viral colds).\n\nBronchodilators or inhalers: For asthma or wheezing.\n\nCough syrups: For dry or wet cough (consult doctor for type).\n\nSteroids: For inflammation or severe asthma (prescribed only)."
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t take antibiotics without a prescription.\n\nDon’t suppress a wet cough too much (coughing helps clear mucus).\n\nDon’t smoke or vape.\n\nDon’t delay seeing a doctor if pain is strong or new."
    }
  ]
}
