{
  "title": "Pain After Surgery",
  "description": "Pain after surgery is a common part of the recovery process. It happens as your body heals from the surgical procedure. The pain can range from mild to severe, depending on the type of surgery and individual healing.",
  "sections": [
    {
      "heading": "Common Symptoms",
      "content": "Pain at the surgical site\n\nSwelling around the area\n\nRedness or warmth around the incision\n\nBruising\n\nStiffness or limited movement in the area\n\nSharp or throbbing pain in the first few days\n\nMild discomfort that may last for weeks or months, depending on the surgery"
    },
    {
      "heading": "Common Causes of Pain After Surgery",
      "content": "**Normal healing process:** As tissues repair, it’s normal to experience pain or discomfort.\n\n**Inflammation:** Swelling and irritation around the surgery site can cause pain.\n\n**Nerve irritation:** Sometimes nerves are affected during surgery, causing pain or tingling.\n\n**Infection:** If bacteria enter the surgical site, it can cause pain, swelling, and fever.\n\n**Complications:** Problems like blood clots, bleeding, or poor healing can lead to additional pain.\n\n**Scar tissue:** After surgery, scar tissue may form, which can cause discomfort or tightness."
    },
    {
      "heading": "Precautions & Home Care",
      "content": "Follow post-surgery instructions from your doctor (e.g., how to care for your incision, when to remove bandages).\n\nRest: Avoid strenuous activities and take breaks to let your body heal.\n\nElevate the affected area (especially if it’s swollen) to reduce swelling.\n\nIce or heat packs: Apply a cold compress to reduce swelling, or use heat to relax tight muscles (only as recommended by your doctor).\n\nPain medication: Take prescribed or over-the-counter pain relievers (like ibuprofen or paracetamol) as directed.\n\nMove gently: If your doctor advises, do light movements or stretches to avoid stiffness but avoid overexerting yourself.\n\nStay hydrated and eat healthy foods to support healing."
    },
    {
      "heading": "When to See a Doctor",
      "content": "Pain gets worse over time, even with medication and rest.\n\nSigns of infection: Redness, warmth, pus, or unusual discharge from the surgical site.\n\nFever over 101°F (38.3°C) or chills.\n\nIncreased swelling or bruising that doesn’t go down with ice or rest.\n\nSevere pain that doesn’t improve after taking pain medication.\n\nSudden pain in the chest, difficulty breathing, or leg swelling (could be signs of a blood clot or other complications).\n\nNausea, vomiting, or dizziness after surgery."
    },
    {
      "heading": "Emergency Signs – Go to the ER If:",
      "content": "Severe pain that doesn’t improve, even after taking prescribed pain medication.\n\nHeavy bleeding from the surgical site that doesn’t stop with pressure.\n\nPain or swelling in the chest, or shortness of breath (could indicate a blood clot).\n\nSigns of infection: A red, hot, or swollen surgical site with pus, fever, or chills.\n\nSudden numbness, weakness, or loss of movement in the affected area."
    },
    {
      "heading": "Treatment from a Doctor",
      "content": "Prescription pain medications: Stronger pain relievers may be given if over-the-counter meds don’t work.\n\nPhysical therapy: In some cases, gentle movements and exercises will be suggested to help recovery and reduce pain.\n\nWound care: If the surgical site is not healing properly, your doctor may need to clean or treat the wound.\n\nAntibiotics: If infection is suspected, antibiotics may be prescribed.\n\nDrainage: If there’s an abscess or collection of fluid, the doctor might drain it.\n\nSurgical revision: In rare cases, if complications arise (eg, poor healing, excess scar tissue), further surgery may be needed."
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t push through the pain—rest and follow your doctor’s advice on when it’s safe to resume normal activities.\n\nDon’t take pain medication more than directed—overusing pain relievers can lead to side effects or complications.\n\nDon’t remove bandages or dressings before your doctor says it’s okay.\n\nDon’t ignore signs of infection—early treatment is important to avoid complications.\n\nDon’t resume heavy physical activities too soon—follow your doctor’s timeline for recovery."
    }
  ]
}
