{
  "title": "Panic Attack",
  "description": "A panic attack is a sudden episode of intense fear or anxiety that often comes without warning. It may feel like losing control or having a heart attack but is caused by high stress or anxiety rather than a physical heart problem.",
  "sections": [
    {
      "heading": "Common Symptoms of a Panic Attack",
      "content": "Symptoms include rapid or pounding heart rate, shortness of breath, chest pain or tightness, dizziness or faintness, sweating, tingling or numbness in hands or feet, choking sensation, trembling or shaking, hot or cold flashes, feelings of detachment from reality, nausea, and fear of dying or going crazy."
    },
    {
      "heading": "What to Do During a Panic Attack",
      "content": "Stay calm and remind yourself it’s not life-threatening. Practice deep breathing by inhaling slowly through the nose for 4 seconds, holding for 4 seconds, and exhaling through the mouth for 4 seconds. Focus on your breathing instead of the fear. Use grounding techniques like the 5-4-3-2-1 method to connect with the present moment. Stay in one place and find a safe, quiet space. Tell someone nearby how you’re feeling for reassurance."
    },
    {
      "heading": "Precautions to Prevent Panic Attacks",
      "content": "Reduce stress with relaxation techniques such as meditation, yoga, or deep breathing. Exercise regularly to lower anxiety. Avoid caffeine and stimulants that may trigger attacks. Maintain healthy sleep habits and eat balanced meals without skipping. Seek professional help if attacks are frequent, including therapy like Cognitive Behavioral Therapy (CBT) to learn coping strategies."
    },
    {
      "heading": "When to Seek Medical Help",
      "content": "If panic attacks occur often or worsen, see a doctor for assessment. Consider therapy or medications to manage anxiety effectively."
    },
    {
      "heading": "Emergency Steps During a Severe Panic Attack",
      "content": "Stay calm and reassure the person that it’s not a heart attack and they are safe. Help guide slow breathing with inhale-hold-exhale cycles of 4 seconds each. Offer water or comforting presence. Stay with them until the attack passes, which usually takes 10–20 minutes."
    }
  ]
}
