{
  "title": "Picky Eating",
  "description": "A behavior often seen in children, characterized by the refusal to eat certain foods or a preference for a limited diet.",
  "sections": [
    {
      "heading": "Definition",
      "content": "Picky eating is a common developmental phase, particularly in toddlers and young children. It involves strong preferences or aversions to certain textures, tastes, or food types. Children may refuse vegetables, prefer specific brands, or insist on repetitive meals. While usually temporary, persistent picky eating may lead to nutritional deficiencies. It is not classified as a disorder unless it significantly impacts health or growth. Parental anxiety often exacerbates the issue. Establishing positive mealtime habits is key. Gradual exposure and non-forceful encouragement are effective strategies. Understanding the child’s sensory preferences helps in managing behavior."
    },
    {
      "heading": "Causes",
      "content": "Causes range from developmental stages to sensory sensitivities. Toddlers naturally seek independence and control, often expressed through food choices. Negative associations with meals, such as forced feeding, can reinforce picky behavior. Food texture, temperature, and color may influence preferences. Genetics also play a role in taste sensitivity. Medical issues like reflux or oral-motor problems may contribute. Lack of structured mealtimes or exposure to processed foods can also play a part. Emotional stress or change in routine can trigger food refusal. Early feeding practices may influence long-term habits."
    },
    {
      "heading": "Symptoms",
      "content": "Symptoms include refusal to try new foods, eating only a few preferred items, gagging or spitting food, and long meal durations. Children may show distress during meals or resist sitting at the table. Nutritional gaps may result in fatigue, slow growth, or poor immunity. Over time, rigid eating patterns may develop. Parents often report family stress around mealtime. Behavioral cues like turning away or crying at sight of food are common. Observation over time helps distinguish between a phase and deeper issues. Growth charts and dietary logs assist in tracking impact."
    },
    {
      "heading": "Treatment",
      "content": "Treatment involves behavioral strategies and nutritional support. Pediatricians may recommend a dietitian to assess nutrient intake. Structured mealtime routines, limited snacks, and no distractions during meals can help. Positive reinforcement and role modeling encourage variety. Avoid pressuring the child, as it may worsen aversion. Repeated exposure (10–15 times) to new foods can improve acceptance. Texture modification and food play are useful for sensory-sensitive children. In severe cases, feeding therapy may be necessary. Supplements might be prescribed if deficiencies are detected. Patience and consistency are key."
    },
    {
      "heading": "Medications",
      "content": "Medications are generally not used for typical picky eating unless an underlying issue is diagnosed. In rare cases of severe food refusal or feeding disorders, appetite stimulants like **Cyproheptadine** may be prescribed under medical supervision. Multivitamins like **PediaSure** may be recommended to fill nutritional gaps. Children with digestive issues might receive **probiotics** or **digestive enzymes**. Always consult a pediatrician before starting any medication or supplement. Behavioral and nutritional approaches are the first line of management. Medication should only be a temporary support tool."
    }
  ]
}
