{
  "title": "Red Eye or Chemical Irritation",
  "description": "Red eye or chemical irritation happens when harmful substances (like cleaning products, shampoo, smoke, or acid/alkali chemicals) get into the eye and cause redness, burning, pain, or damage.",
  "sections": [
    {
      "heading": "Symptoms",
      "content": "Redness in the white part of the eye\n\nBurning, stinging, or pain\n\nTearing (watery eye)\n\nBlurry vision\n\nSwelling around the eye\n\nFeeling like something is stuck in the eye\n\nSensitivity to light\n\nIn severe cases: loss of vision or color change in the eye"
    },
    {
      "heading": "What to Do Immediately (First Aid)",
      "content": "1) Rinse the eye immediately!\n- Use clean, lukewarm water, saline solution, or eye wash.\n- Rinse for 15 to 30 minutes, keeping the eye open as wide as possible.\n- If wearing contact lenses, remove them during rinsing.\n\n2) Keep rinsing even if the pain goes down — some chemicals can cause delayed damage.\n\n3) Avoid rubbing or touching the eye.\n\n4) Cover the eye with a clean cloth or sterile dressing only if necessary (don’t use cotton directly in the eye)."
    },
    {
      "heading": "When to Go to the Doctor or ER",
      "content": "The chemical is strong (like bleach, acid, battery fluid)\n\nEye pain is severe or doesn’t improve after rinsing\n\nVision is blurry or there’s eye discharge\n\nYou see white or cloudy spots on the eye\n\nBoth eyes are affected\n\nInjury was caused by heat, fumes, or sharp objects\n\nAny case involving children or pets"
    },
    {
      "heading": "Emergency Medicines (by doctor only)",
      "content": "Antibiotic eye drops – To prevent infection\n\nSteroid eye drops – To reduce inflammation\n\nLubricant drops – For comfort and healing\n\nPain relief drops – For severe discomfort"
    },
    {
      "heading": "Precautions",
      "content": "Always wear eye protection when using chemicals.\n\nRead chemical labels and safety instructions.\n\nKeep clean water or saline nearby when working with harmful products.\n\nStore chemicals safely out of reach of children."
    },
    {
      "heading": "What Not to Do",
      "content": "Don’t delay rinsing – start immediately.\n\nDon’t rub your eyes — it can make the injury worse.\n\nDon’t use milk, oils, or home remedies — only water or saline.\n\nDon’t put in eye drops (unless advised by a doctor) right after a chemical injury."
    }
  ]
}
