{
  "title": "Suicidal Thoughts or Behavior",
  "description": "Recognizing the warning signs of suicidal thoughts or behavior is crucial to providing timely support and preventing harm.",
  "sections": [
    {
      "heading": "Common Signs",
      "content": "Talking about wanting to die or 'not being around anymore', expressing feelings of hopelessness or worthlessness, withdrawing from friends, family, or activities, extreme mood swings or dramatic changes in behavior, giving away personal belongings or making final arrangements, talking about feeling like a burden on others, engaging in reckless behavior or seeking out means to harm oneself."
    },
    {
      "heading": "Steps to Help Someone Showing Suicidal Thoughts or Behavior",
      "content": "1) Take the Person Seriously: Always take any talk of suicide seriously and listen non-judgmentally.\n2) Encourage Open Communication: Ask directly if they are thinking about harming themselves and be supportive.\n3) Stay Calm and Reassuring: Reassure them they are not alone and help is available.\n4) Do Not Leave Them Alone: Stay with the person until help arrives or they are safe.\n5) Remove Any Harmful Items: Remove access to weapons, medications, or sharp objects.\n6) Seek Immediate Help: Call suicide prevention hotlines or emergency services and encourage professional help."
    },
    {
      "heading": "What NOT to Do",
      "content": "Do not dismiss their feelings or minimize their pain.\nDo not argue or try to convince them not to feel the way they do.\nDo not leave them alone if they are in immediate danger."
    },
    {
      "heading": "When to Seek Emergency Help",
      "content": "If the person has a plan or is actively attempting to harm themselves, call emergency services immediately.\nTake all expressions of desire to die or self-harm seriously.\nSeek medical attention if there are signs of self-harm such as cuts, bruises, or burns."
    },
    {
      "heading": "After Immediate Crisis: Long-Term Support",
      "content": "Encourage professional treatment with therapists, counselors, or psychiatrists.\nStay connected and offer ongoing emotional support.\nBe patient and encourage small steps toward recovery."
    },
    {
      "heading": "Important Helplines (India)",
      "content": "Vandrevala Foundation (Mental Health Support): +91 9152987821\nSnehi Suicide Prevention Helpline: 91-22-2772 6771\nAASRA Foundation: 91-9820466726"
    }
  ]
}
